////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = НСтр("ru='Продажи по дисконтным картам'")
		+ УправлениеПечатьюРТКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода,
		Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.Организация) И Форма.ИспользуетсяНесколькоОрганизаций Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + Отчет.Организация;
	КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;
	
КонецПроцедуры

Функция ПолучениеДанныхЧерезСКД()
	
			
КонецФункции
 

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ОчиститьСообщения();
	
	 СформироватьОтчетНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПериод(Команда)
		
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ
&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	//ОбновитьТекстЗаголовка(ЭтаФорма);
	//
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ПроверкаКонтрагентовКлиент.СброситьАктуальностьОтчета(ЭтотОбъект);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	//ОбновитьТекстЗаголовка(ЭтаФорма);
	//
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ПроверкаКонтрагентовКлиент.СброситьАктуальностьОтчета(ЭтотОбъект);
	//КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаСервере
Процедура РассчитатьОбластьПечати()

	//ПерваяСтрока = 1;
	//
	//Если ОткрыватьПомощникИзМакета Тогда
	//	ПерваяСтрока = ПерваяСтрока + 1;
	//КонецЕсли;
	//
	//Результат.ОбластьПечати = Результат.Область(ПерваяСтрока,1,Результат.ВысотаТаблицы, Результат.ШиринаТаблицы);

КонецПроцедуры


&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Макет = ПолучитьМакетНаСервере();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПродажиПоДисконтнымКартам";

	Заголовок				= Макет.ПолучитьОбласть("Заголовок");
	ТекстПараметры		= Макет.ПолучитьОбласть("ПараметрыОтчета");
	СтрокаОтчета			= Макет.ПолучитьОбласть("СтрокаОтчета");
	ИтогоПродано			= Макет.ПолучитьОбласть("ИтогоПродано");
	
	//ТабличныйДокумент.Вывести();
	
	Запрос = ТекстЗапросаПродажиПоДисконту();
	
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	КонецЦикла; 
	
КонецФункции

&НаСервере
Функция ПолучитьМакетНаСервере()
    ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
    Макет = ОтчетОбъект.ПолучитьМакет("ОтчетДисконтныеКарты"); 
    Возврат Макет;
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура;
	
	Если ЗначениеЗаполнено(Отчет.ВидДисконтнойКарты) Тогда
		ПараметрыОтчета.Вставить("ВидДисконтнойКарты", Отчет.ВидДисконтнойКарты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.ДисконтнаяКарта) Тогда
		ПараметрыОтчета.Вставить("ДисконтнаяКарта", Отчет.ДисконтнаяКарта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		ПараметрыОтчета.Вставить("НачалоПериода", Отчет.НачалоПериода);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отчет.ОкончаниеПериода) Тогда
		ПараметрыОтчета.Вставить("ОкончаниеПериода", Отчет.ОкончаниеПериода);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отчет.Магазин) Тогда
		ПараметрыОтчета.Вставить("Магазин", Отчет.Магазин);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отчет.Номенклатура) Тогда
		ПараметрыОтчета.Вставить("Номенклатура", Отчет.Номенклатура);
	КонецЕсли; 
	
	// Поддержка возможности формирования отчета за произвольный период
	Если КонецДня(Отчет.КонецПериода) <> КонецКвартала(Отчет.НачалоПериода) ИЛИ НачалоДня(Отчет.НачалоПериода) <> НачалоКвартала(Отчет.НачалоПериода) Тогда
		ПараметрыОтчета.Вставить("КонецПериода", Отчет.КонецПериода);
	КонецЕсли;
	
	Возврат ПараметрыОтчета;
	
КонецФункции
